# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

first   = '1. orange'
second  = '2. kiwi'
third   = '3. apple'

print('\n{} \n{} \n{}'.format(first, second, third))

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

ListO = ['red', 'blue', 'green', 'white']

ListT = ['red', 'white', 'purple', 'orange']

print('\n', ListO)

print('\n', ListT)

print('\n', list(set(ListO)-set(ListT)), '\n')


# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

print ("\n Введите любое кол-во цифр через пробел:")

listing = [int(x) for x in input().split()]

b = 0

c = 0

for x in listing:
    if x % 2 == 0:
        b = x / 4
        print ("\n ", b)
    if x % 2 != 0:
        c = x * 2
        print ("\n ", c)
